{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "ResNet34", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 112, 112, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "conv1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv1_pad", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1_conv", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv1_bn", "inbound_nodes": [[["conv1_conv", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "conv1_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "conv1_prelu", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block1_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block1_1_bn", "inbound_nodes": [[["conv1_prelu", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv2_block1_1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv2_block1_1_pad", "inbound_nodes": [[["conv2_block1_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_block1_1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_block1_1_conv", "inbound_nodes": [[["conv2_block1_1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block1_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block1_2_bn", "inbound_nodes": [[["conv2_block1_1_conv", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "conv2_block1_1_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "conv2_block1_1_prelu", "inbound_nodes": [[["conv2_block1_2_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv2_block1_2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv2_block1_2_pad", "inbound_nodes": [[["conv2_block1_1_prelu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_block1_0_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_block1_0_conv", "inbound_nodes": [[["conv1_prelu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_block1_2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_block1_2_conv", "inbound_nodes": [[["conv2_block1_2_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block1_0_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block1_0_bn", "inbound_nodes": [[["conv2_block1_0_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block1_3_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block1_3_bn", "inbound_nodes": [[["conv2_block1_2_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "conv2_block1_add", "trainable": true, "dtype": "float32"}, "name": "conv2_block1_add", "inbound_nodes": [[["conv2_block1_0_bn", 0, 0, {}], ["conv2_block1_3_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block2_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block2_1_bn", "inbound_nodes": [[["conv2_block1_add", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv2_block2_1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv2_block2_1_pad", "inbound_nodes": [[["conv2_block2_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_block2_1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_block2_1_conv", "inbound_nodes": [[["conv2_block2_1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block2_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block2_2_bn", "inbound_nodes": [[["conv2_block2_1_conv", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "conv2_block2_1_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "conv2_block2_1_prelu", "inbound_nodes": [[["conv2_block2_2_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv2_block2_2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv2_block2_2_pad", "inbound_nodes": [[["conv2_block2_1_prelu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_block2_2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_block2_2_conv", "inbound_nodes": [[["conv2_block2_2_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block2_3_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block2_3_bn", "inbound_nodes": [[["conv2_block2_2_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "conv2_block2_add", "trainable": true, "dtype": "float32"}, "name": "conv2_block2_add", "inbound_nodes": [[["conv2_block1_add", 0, 0, {}], ["conv2_block2_3_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block3_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block3_1_bn", "inbound_nodes": [[["conv2_block2_add", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv2_block3_1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv2_block3_1_pad", "inbound_nodes": [[["conv2_block3_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_block3_1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_block3_1_conv", "inbound_nodes": [[["conv2_block3_1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block3_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block3_2_bn", "inbound_nodes": [[["conv2_block3_1_conv", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "conv2_block3_1_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "conv2_block3_1_prelu", "inbound_nodes": [[["conv2_block3_2_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv2_block3_2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv2_block3_2_pad", "inbound_nodes": [[["conv2_block3_1_prelu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2_block3_2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2_block3_2_conv", "inbound_nodes": [[["conv2_block3_2_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2_block3_3_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2_block3_3_bn", "inbound_nodes": [[["conv2_block3_2_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "conv2_block3_add", "trainable": true, "dtype": "float32"}, "name": "conv2_block3_add", "inbound_nodes": [[["conv2_block2_add", 0, 0, {}], ["conv2_block3_3_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block1_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block1_1_bn", "inbound_nodes": [[["conv2_block3_add", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv3_block1_1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv3_block1_1_pad", "inbound_nodes": [[["conv3_block1_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_block1_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_block1_1_conv", "inbound_nodes": [[["conv3_block1_1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block1_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block1_2_bn", "inbound_nodes": [[["conv3_block1_1_conv", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "conv3_block1_1_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "conv3_block1_1_prelu", "inbound_nodes": [[["conv3_block1_2_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv3_block1_2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv3_block1_2_pad", "inbound_nodes": [[["conv3_block1_1_prelu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_block1_0_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_block1_0_conv", "inbound_nodes": [[["conv2_block3_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_block1_2_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_block1_2_conv", "inbound_nodes": [[["conv3_block1_2_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block1_0_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block1_0_bn", "inbound_nodes": [[["conv3_block1_0_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block1_3_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block1_3_bn", "inbound_nodes": [[["conv3_block1_2_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "conv3_block1_add", "trainable": true, "dtype": "float32"}, "name": "conv3_block1_add", "inbound_nodes": [[["conv3_block1_0_bn", 0, 0, {}], ["conv3_block1_3_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block2_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block2_1_bn", "inbound_nodes": [[["conv3_block1_add", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv3_block2_1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv3_block2_1_pad", "inbound_nodes": [[["conv3_block2_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_block2_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_block2_1_conv", "inbound_nodes": [[["conv3_block2_1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block2_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block2_2_bn", "inbound_nodes": [[["conv3_block2_1_conv", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "conv3_block2_1_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "conv3_block2_1_prelu", "inbound_nodes": [[["conv3_block2_2_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv3_block2_2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv3_block2_2_pad", "inbound_nodes": [[["conv3_block2_1_prelu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_block2_2_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_block2_2_conv", "inbound_nodes": [[["conv3_block2_2_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block2_3_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block2_3_bn", "inbound_nodes": [[["conv3_block2_2_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "conv3_block2_add", "trainable": true, "dtype": "float32"}, "name": "conv3_block2_add", "inbound_nodes": [[["conv3_block1_add", 0, 0, {}], ["conv3_block2_3_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block3_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block3_1_bn", "inbound_nodes": [[["conv3_block2_add", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv3_block3_1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv3_block3_1_pad", "inbound_nodes": [[["conv3_block3_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_block3_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_block3_1_conv", "inbound_nodes": [[["conv3_block3_1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block3_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block3_2_bn", "inbound_nodes": [[["conv3_block3_1_conv", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "conv3_block3_1_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "conv3_block3_1_prelu", "inbound_nodes": [[["conv3_block3_2_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv3_block3_2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv3_block3_2_pad", "inbound_nodes": [[["conv3_block3_1_prelu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_block3_2_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_block3_2_conv", "inbound_nodes": [[["conv3_block3_2_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block3_3_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block3_3_bn", "inbound_nodes": [[["conv3_block3_2_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "conv3_block3_add", "trainable": true, "dtype": "float32"}, "name": "conv3_block3_add", "inbound_nodes": [[["conv3_block2_add", 0, 0, {}], ["conv3_block3_3_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block4_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block4_1_bn", "inbound_nodes": [[["conv3_block3_add", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv3_block4_1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv3_block4_1_pad", "inbound_nodes": [[["conv3_block4_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_block4_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_block4_1_conv", "inbound_nodes": [[["conv3_block4_1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block4_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block4_2_bn", "inbound_nodes": [[["conv3_block4_1_conv", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "conv3_block4_1_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "conv3_block4_1_prelu", "inbound_nodes": [[["conv3_block4_2_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv3_block4_2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv3_block4_2_pad", "inbound_nodes": [[["conv3_block4_1_prelu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3_block4_2_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3_block4_2_conv", "inbound_nodes": [[["conv3_block4_2_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3_block4_3_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3_block4_3_bn", "inbound_nodes": [[["conv3_block4_2_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "conv3_block4_add", "trainable": true, "dtype": "float32"}, "name": "conv3_block4_add", "inbound_nodes": [[["conv3_block3_add", 0, 0, {}], ["conv3_block4_3_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4_block1_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4_block1_1_bn", "inbound_nodes": [[["conv3_block4_add", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv4_block1_1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv4_block1_1_pad", "inbound_nodes": [[["conv4_block1_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4_block1_1_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4_block1_1_conv", "inbound_nodes": [[["conv4_block1_1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4_block1_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4_block1_2_bn", "inbound_nodes": [[["conv4_block1_1_conv", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "conv4_block1_1_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "conv4_block1_1_prelu", "inbound_nodes": [[["conv4_block1_2_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv4_block1_2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv4_block1_2_pad", "inbound_nodes": [[["conv4_block1_1_prelu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4_block1_0_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4_block1_0_conv", "inbound_nodes": [[["conv3_block4_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4_block1_2_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4_block1_2_conv", "inbound_nodes": [[["conv4_block1_2_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4_block1_0_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4_block1_0_bn", "inbound_nodes": [[["conv4_block1_0_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4_block1_3_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4_block1_3_bn", "inbound_nodes": [[["conv4_block1_2_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "conv4_block1_add", "trainable": true, "dtype": "float32"}, "name": "conv4_block1_add", "inbound_nodes": [[["conv4_block1_0_bn", 0, 0, {}], ["conv4_block1_3_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4_block2_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4_block2_1_bn", "inbound_nodes": [[["conv4_block1_add", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv4_block2_1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv4_block2_1_pad", "inbound_nodes": [[["conv4_block2_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4_block2_1_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4_block2_1_conv", "inbound_nodes": [[["conv4_block2_1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4_block2_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4_block2_2_bn", "inbound_nodes": [[["conv4_block2_1_conv", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "conv4_block2_1_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "conv4_block2_1_prelu", "inbound_nodes": [[["conv4_block2_2_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv4_block2_2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv4_block2_2_pad", "inbound_nodes": [[["conv4_block2_1_prelu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4_block2_2_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4_block2_2_conv", "inbound_nodes": [[["conv4_block2_2_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4_block2_3_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4_block2_3_bn", "inbound_nodes": [[["conv4_block2_2_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "conv4_block2_add", "trainable": true, "dtype": "float32"}, "name": "conv4_block2_add", "inbound_nodes": [[["conv4_block1_add", 0, 0, {}], ["conv4_block2_3_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4_block3_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4_block3_1_bn", "inbound_nodes": [[["conv4_block2_add", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv4_block3_1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv4_block3_1_pad", "inbound_nodes": [[["conv4_block3_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4_block3_1_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4_block3_1_conv", "inbound_nodes": [[["conv4_block3_1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4_block3_2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4_block3_2_bn", "inbound_nodes": [[["conv4_block3_1_conv", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "conv4_block3_1_prelu", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [1, 2]}, "name": "conv4_block3_1_prelu", "inbound_nodes": [[["conv4_block3_2_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv4_block3_2_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv4_block3_2_pad", "inbound_nodes": [[["conv4_block3_1_prelu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4_block3_2_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4_block3_2_conv", "inbound_nodes": [[["conv4_block3_2_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4_block3_3_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4_block3_3_bn", "inbound_nodes": [[["conv4_block3_2_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "conv4_block3_add", "trainable": true, "dtype": "float32"}, "name": "conv4_block3_add", "inbound_nodes": [[["conv4_block2_add", 0, 0, {}], ["conv4_block3_3_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4_block4_1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4_block4_1_bn", "inbound_nodes": [[["conv4_block3_add", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "conv4_block4_1_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "conv4_block4_1_pad", "inbound_nodes": 